id: 0c45a8aa-fa51-4c42-a09b-24b3d4f39ebb
status: experimental
title: Multiple Failed Logins Followed by Success
description: Detects multiple failed login attempts followed by a successful login for the same user within 2 minutes, indicating a possible brute force attack.
date: 2024/09/27
author: lr2t9iz
references:
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4625 
  - https://www.elastic.co/guide/en/security/8.15/prebuilt-rule-8-3-2-multiple-logon-failure-followed-by-logon-success.html
tags:
  - attack.credential-access
  - attack.t1110
logsource:
  category: authentication
  product: windows
detection:
  failed_logins:
    EventID: 4625
    UserName: "*"
  successful_login:
    EventID: 4624
    UserName: "*"
  condition: | # define N 
    (failed_logins | count(N) by UserName) followed by successful_login by UserName within 2m
fields:
  - UserName
falsepositives:
  - Unknown
level: high
